Documents/skill-development.org
See [[id:af7d5308-49fa-4ed5-b9d7-630ffb44121b][Skillsplosion]] (created before this note but still more relevant than this) for more skill development info

* What skills am I developing?
- Time management
- Planning
- Documentation-writing
- Go programming
- Research
- Evaluation

* Choosing a topic
** For dissertations
- It's important to choose a topic that can allow you to make judgements not just move information
- For this asking questions can be best
** For artefacts
- It's important that if anyone else is involved some skill development clearly comes from you
- It's important that the project is not too basic to exclude skill development
- It's important that you haven't done the project before

* How could skills be evidenced?
- Before/after
- Self-evaluation of skills
- Producing things that require the skills
