Documents/skill-development.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Skyler Turner's EPQ</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">Skyler Turner's EPQ</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2022-01-23.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1b2b6c7">What skills am I developing?</a></li>
<li><a href="#orgf74183b">Choosing a topic</a>
<ul>
<li><a href="#org7501d5b">For dissertations</a></li>
<li><a href="#orgff1eade">For artefacts</a></li>
</ul>
</li>
<li><a href="#org87c8145">How could skills be evidenced?</a></li>
</ul>
</div>
</div>
<p>
See <a href="../Notes/20211212220043-skillsplosion.html#ID-af7d5308-49fa-4ed5-b9d7-630ffb44121b">Skillsplosion</a> (created before this note but still more relevant than this) for more skill development info
</p>

<div id="outline-container-org1b2b6c7" class="outline-2">
<h2 id="org1b2b6c7">What skills am I developing?</h2>
<div class="outline-text-2" id="text-org1b2b6c7">
<ul class="org-ul">
<li>Time management</li>
<li>Planning</li>
<li>Documentation-writing</li>
<li>Go programming</li>
<li>Research</li>
<li>Evaluation</li>
</ul>
</div>
</div>

<div id="outline-container-orgf74183b" class="outline-2">
<h2 id="orgf74183b">Choosing a topic</h2>
<div class="outline-text-2" id="text-orgf74183b">
</div>
<div id="outline-container-org7501d5b" class="outline-3">
<h3 id="org7501d5b">For dissertations</h3>
<div class="outline-text-3" id="text-org7501d5b">
<ul class="org-ul">
<li>It's important to choose a topic that can allow you to make judgements not just move information</li>
<li>For this asking questions can be best</li>
</ul>
</div>
</div>
<div id="outline-container-orgff1eade" class="outline-3">
<h3 id="orgff1eade">For artefacts</h3>
<div class="outline-text-3" id="text-orgff1eade">
<ul class="org-ul">
<li>It's important that if anyone else is involved some skill development clearly comes from you</li>
<li>It's important that the project is not too basic to exclude skill development</li>
<li>It's important that you haven't done the project before</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org87c8145" class="outline-2">
<h2 id="org87c8145">How could skills be evidenced?</h2>
<div class="outline-text-2" id="text-org87c8145">
<ul class="org-ul">
<li>Before/after</li>
<li>Self-evaluation of skills</li>
<li>Producing things that require the skills</li>
</ul>
</div>
</div>
</div>
</body>
</html>
